# Pandas : ( Part 3 )
# Topics :
### - pd.melt(df) , pd.concat([df1,df2]) , pd.concat([df,df2],axis=1) , .sort_values('') , .sort_values('',ascending=False)
### - .sort_index() , .reset_index() , df[df.Length > 7] , .sample(frac=0.5) , .sample(n=10) ,
### - .describe() , len() , .sum() , .count() , .mean() , .median() , .min() , .max() , .quantile([0.25,0.50,0.75])
### - .std , .var , .apply()

In [ ]:
# Lets start...

# Pandas ( Reshaping Data â€“ Change the layout of a data set )

In [1]:
import numpy as np 
import pandas as pd
df=pd.DataFrame(dict(a=range(1,4),b=range(2,5),c=range(3,6)))
df1=pd.DataFrame(dict(a=range(2,5),b=range(3,6),c=range(4,7)))
df

   a  b  c
0  1  2  3
1  2  3  4
2  3  4  5

In [2]:
pd.melt(df)      #gathering columns into rows

  variable  value
0        a      1
1        a      2
2        a      3
3        b      2
4        b      3
5        b      4
6        c      3
7        c      4
8        c      5

In [3]:
df

   a  b  c
0  1  2  3
1  2  3  4
2  3  4  5

In [4]:
df1

   a  b  c
0  2  3  4
1  3  4  5
2  4  5  6

In [5]:
pd.concat([df,df1])   #conacacenate rows below rows if axis = 0

   a  b  c
0  1  2  3
1  2  3  4
2  3  4  5
0  2  3  4
1  3  4  5
2  4  5  6

In [6]:
df2=pd.DataFrame(dict(a=range(2,5),b=range(3,6)))
df2

   a  b
0  2  3
1  3  4
2  4  5

In [7]:
df3=pd.concat([df1,df2],axis=1)     #concacenate columns by columns if axis=1
df3

   a  b  c  a  b
0  2  3  4  2  3
1  3  4  5  3  4
2  4  5  6  4  5

In [8]:
df

   a  b  c
0  1  2  3
1  2  3  4
2  3  4  5

In [9]:
df4=pd.DataFrame(dict(a=[5,4,6],b=range(3,6),c=range(2,5)))
df4

   a  b  c
0  5  3  2
1  4  4  3
2  6  5  4

In [10]:
df4.sort_values('a')     #asscending rows low to high w.r.t 'a'

   a  b  c
1  4  4  3
0  5  3  2
2  6  5  4

In [11]:
df=df.sort_values('a',ascending=False)   #decending rows w.r.t 'a'
df

   a  b  c
2  3  4  5
1  2  3  4
0  1  2  3

In [12]:
df

   a  b  c
2  3  4  5
1  2  3  4
0  1  2  3

In [13]:
df.sort_index()      #return to original

   a  b  c
0  1  2  3
1  2  3  4
2  3  4  5

In [14]:
df

   a  b  c
2  3  4  5
1  2  3  4
0  1  2  3

In [15]:
df[:2]

   a  b  c
2  3  4  5
1  2  3  4

In [16]:
df.iloc[0,0]

3

In [17]:
df

   a  b  c
2  3  4  5
1  2  3  4
0  1  2  3

In [18]:
df.reset_index()

   index  a  b  c
0      2  3  4  5
1      1  2  3  4
2      0  1  2  3

In [19]:
df.drop(columns=['a','b'])     #better method to drop columns

   c
2  5
1  4
0  3

In [20]:
df

   a  b  c
2  3  4  5
1  2  3  4
0  1  2  3

# Subset Observations (Rows)

In [21]:
df[df.a < 3]   #exract rows which meet condition

   a  b  c
1  2  3  4
0  1  2  3

In [22]:
df.sample(frac=0.5)         # doubt

   a  b  c
2  3  4  5
1  2  3  4

In [23]:
df2

   a  b
0  2  3
1  3  4
2  4  5

In [24]:
df2.iloc[2,0]=3
df2.iloc[2,1]=3
df2.iloc[0,0]=4
df2.iloc[2,1]=4
df2

   a  b
0  4  3
1  3  4
2  3  4

In [25]:
df2.drop_duplicates()          #Remove duplicate rows

   a  b
0  4  3
1  3  4

# Subset Variables (Columns)

In [26]:
df2.a      #or df2['a']

0    4
1    3
2    3
Name: a, dtype: int64

In [27]:
df

   a  b  c
2  3  4  5
1  2  3  4
0  1  2  3

In [28]:
df.iloc[:,[0,2]]

   a  c
2  3  5
1  2  4
0  1  3

In [29]:
df

   a  b  c
2  3  4  5
1  2  3  4
0  1  2  3

In [30]:
df.loc[df.a < 3, ['a','c']]
      #both rows and columns

   a  c
1  2  4
0  1  3

In [31]:
df

   a  b  c
2  3  4  5
1  2  3  4
0  1  2  3

# Summarize Data

In [32]:
df

   a  b  c
2  3  4  5
1  2  3  4
0  1  2  3

In [33]:
df.describe()

         a    b    c
count  3.0  3.0  3.0
mean   2.0  3.0  4.0
std    1.0  1.0  1.0
min    1.0  2.0  3.0
25%    1.5  2.5  3.5
50%    2.0  3.0  4.0
75%    2.5  3.5  4.5
max    3.0  4.0  5.0

In [34]:
#df[].unique , df[]nunique

In [35]:
df

   a  b  c
2  3  4  5
1  2  3  4
0  1  2  3

In [36]:
len(df)   # number of rows in df

3

In [44]:
df

   a  b  c
2  3  4  5
1  2  3  4
0  1  2  3

In [45]:
df.describe()

         a    b    c
count  3.0  3.0  3.0
mean   2.0  3.0  4.0
std    1.0  1.0  1.0
min    1.0  2.0  3.0
25%    1.5  2.5  3.5
50%    2.0  3.0  4.0
75%    2.5  3.5  4.5
max    3.0  4.0  5.0

In [64]:
df.sum()

a     6
b     9
c    12
dtype: int64

In [48]:
df.count()

a    3
b    3
c    3
dtype: int64

In [49]:
df.mean()

a    2.0
b    3.0
c    4.0
dtype: float64

In [50]:
df.std()

a    1.0
b    1.0
c    1.0
dtype: float64

In [51]:
df.min()

a    1
b    2
c    3
dtype: int64

In [52]:
df.max()

a    3
b    4
c    5
dtype: int64

In [53]:
df.median()

a    2.0
b    3.0
c    4.0
dtype: float64

In [54]:
df.var()

a    1.0
b    1.0
c    1.0
dtype: float64

In [62]:
df.quantile([0.25,0.50,0.75])

        a    b    c
0.25  1.5  2.5  3.5
0.50  2.0  3.0  4.0
0.75  2.5  3.5  4.5

df.apply()

# Handling Missing Data

In [65]:
df.dropna()

   a  b  c
2  3  4  5
1  2  3  4
0  1  2  3

In [66]:
df.fillna(0)

   a  b  c
2  3  4  5
1  2  3  4
0  1  2  3

# Combine Data sets

In [115]:
import numpy as np
import pandas as pd
adf=pd.DataFrame(dict(a=1,c=3,d=4),index=['x','y','z'])
bdf=pd.DataFrame(dict(a=4,b=2),index=['x','y','z1'])
adf

   a  c  d
x  1  3  4
y  1  3  4
z  1  3  4

In [116]:
bdf

    a  b
x   4  2
y   4  2
z1  4  2

In [117]:
pd.merge(adf,bdf,how='left')

   a  c  d   b
0  1  3  4 NaN
1  1  3  4 NaN
2  1  3  4 NaN

In [118]:
pd.merge(adf,bdf,how='right')

   a   c   d  b
0  4 NaN NaN  2
1  4 NaN NaN  2
2  4 NaN NaN  2

In [123]:
pd.merge(adf,bdf,how='left')

   a  c  d   b
0  1  3  4 NaN
1  1  3  4 NaN
2  1  3  4 NaN

In [124]:
adf

   a  c  d
x  1  3  4
y  1  3  4
z  1  3  4

In [127]:
bdf

    a  b
x   4  2
y   4  2
z1  4  2

In [125]:
pd.merge(adf,bdf,how='inner')

Empty DataFrame
Columns: [a, c, d, b]
Index: []

In [126]:
pd.merge(adf,bdf,how='outer')

   a    c    d    b
0  1  3.0  4.0  NaN
1  1  3.0  4.0  NaN
2  1  3.0  4.0  NaN
3  4  NaN  NaN  2.0
4  4  NaN  NaN  2.0
5  4  NaN  NaN  2.0

In [ ]:
# To Be Continued...